# GridCenterSegmentWeight Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GridCenterSegmentWeight Property
ParameterTypeId Class See Also
---
"Center Segment Weight"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GridCenterSegmentWeight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GridCenterSegmentWeight As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GridCenterSegmentWeight {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace